//for 반복문
// for (초기식; 조건식; 증감식){반복적으로 실행해야 되는 코드}

//for 문을 만나면 초기식에 적어놓은 변수를 세팅 함.
//실행 순서 : 초기식-> 조건식-. 실행코드 -> 증감식 -> 조건식-. 실행코드 -> 증감식 ->조건식이 false가 나올 때까지
// 초기식 : 하나의 변수를 할당해서 값을 집어넣는 식
//조건식 : 반복을 해도 되는지 따지는 식-> 초기식의 변수를 통한 비교식을 세움

var i=1;
for (var i= 1; i <=3 ; i++) {
    console.log(i+"번째 반복");
}

//1.초기식 때 i =1
//2.조건문에서 1<= 3을 보면 true 값 '실행해도 된다'
//3.코드블록인  console.log("1번째 반복");이 실행됨
//4.증감식인 i++이 실행되어 i=2
//1~4까지가 한 사이클

//5.조건문에서 2<=3을 보면 true값 '실행해도 된다'
//6. 코드블록인  console.log(2번째 반복"); 이 실행됨
//7. 증감식인 i++이 실행되어 i =3
//5~7까지가 2사이클

//8.조건문에서 3<=3을 보면 true 값 '실행도 된다'
//9.코드블록인  console.log("3번째 반복"); 이 실행됨
//10.증감식인 i++이 실행되어 i=4
//11.조건문에서 4<=4를 보면 false 값이 되어 '끝내'가 된다 =>**3사이클까지 돌고 4사이클에서 마무리 지어짐**

// 초기식은 한 번만 실행됨 첫번째 사이클부터 모든 사이클은 그냥 실행하는 게 아니라 조건문식에 따라 판단하여 실행

//1부터 10까지 더하기

var sum=0;
for (var n=1; n<=10; n++) {
    sum += n; // sum =sum +n;
}
// 첫번째 사이클 : sum = sum +n; // sum0, n 1= 0 + 1 =1
// 두번째 사이클 : sum = sum +n; // sum1, n 2= 1 + 2 =3
// 세번째 사이클 : sum = sum +n; // sum3, n 3= 3 + 3 =6
// 네번째 사이클 : sum = sum +n; // sum6, n 4= 6 + 4 =10
// 다섯번째 사이클 : sum = sum +n; // sum10, n 5= 10 + 5 =15
// 여섯번째 사이클 : sum = sum +n; // sum15, n 6= 15 + 6 =21

//중첩 반복문 : 그냥 for 문 안에 for 문을 사용하는 것(ex)구구단
//구구단 !만들어 보면
for(var dan =2; dan <=2; dan++){
   for (k =1; k<=9; k++) {
    console.log(`${dan}*${k}=${dan*k}`);
}
}

